tutorials/cases/charOnlyMoveCases/serial_stage1/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue Ts 0
    volScalarFieldValue porosityF  1. 
    volScalarFieldValue porosityF0 1.
    volScalarFieldValue Yrubberwood  0.
    volScalarFieldValue Ychar   1.  
    volScalarFieldValue Yhum  0.
    volScalarFieldValue Yash  0.
);

regions
(
    // Char blob: a band of solid material that the prescribed Us advects in +x.
    boxToCell
    {
        box (0.007 0.004 -1) (0.013 0.006 1);
        //box (0.00 0.004 -1) (0.02 0.006 1);
        fieldValues
        (
            volScalarFieldValue Ychar      0.9
            volScalarFieldValue Yash        0.1
            volScalarFieldValue porosityF   0.99
            volScalarFieldValue porosityF0  0.99
            volScalarFieldValue Ts          300
        );
    }

    // Prescribed solid velocity over the band the blob occupies (no Yade here).
    boxToCell
    {
        box (0.0 0 -1) (0.02 0.01 1);
        fieldValues
        (
            volVectorFieldValue Us (0.01 0 0)
        );
    }
);

// ************************************************************************* //
